Revit 2024 API
BuiltInFailures.KeyBasedTreeFileFailures.CannotOpenFileForRead Property
 Cannot open file [FileName].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotOpenFileForRead { get; }
Visual Basic
Public Shared ReadOnly Property CannotOpenFileForRead As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotOpenFileForRead {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.KeyBasedTreeFileFailures Class
Autodesk.Revit.DB Namespace